Autodesk.Revit.DB.ResolutionTarget
Indicates the resolution target(Screen or Printer) used for rendering settings.
Since:
2013

Autodesk.Revit.DB.ResolutionTarget.Printer
Uses printer resolution for rendering output settings.

Autodesk.Revit.DB.ResolutionTarget.Screen
Uses screen resolution for rendering output settings.